# MetallicpaintTopcoat Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MetallicPaint..::..MetallicpaintTopcoat Property
MetallicPaint Class See Also
---
The property labeled "Top Coat" from the "MetallicPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetallicpaintTopcoat { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetallicpaintTopcoat As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetallicpaintTopcoat {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintTopcoatType".
# See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace